bdbm_drv_new_version/run/fio/log/f_iops/1_fio_b1024-1.txt
fio1: (g=0): rw=write, bs=4096B-4096B,4096B-4096B,4096B-4096B, ioengine=libaio, iodepth=128
fio-2.17-37-g855f-dirty
Starting 1 process
fio1: Laying out IO file(s) (1 file(s) / 1000MiB)

fio1: (groupid=0, jobs=1): err= 0: pid=9253: Sun Mar 12 21:42:00 2017
  write: IOPS=5777, BW=22.6MiB/s (23.7MB/s)(1000MiB/44311msec)
    slat (usec): min=3, max=25823, avg=172.37, stdev=600.27
    clat (usec): min=2, max=46779, avg=21974.19, stdev=4737.25
     lat (usec): min=7, max=46787, avg=22146.56, stdev=4764.11
    clat percentiles (usec):
     |  1.00th=[ 4512],  5.00th=[14400], 10.00th=[17280], 20.00th=[19584],
     | 30.00th=[21376], 40.00th=[21632], 50.00th=[21632], 60.00th=[22656],
     | 70.00th=[23680], 80.00th=[23936], 90.00th=[26752], 95.00th=[30848],
     | 99.00th=[34560], 99.50th=[36096], 99.90th=[39680], 99.95th=[40704],
     | 99.99th=[44288]
    lat (usec) : 4=0.01%, 10=0.01%, 20=0.01%, 50=0.01%, 100=0.01%
    lat (usec) : 750=0.52%, 1000=0.24%
    lat (msec) : 2=0.03%, 4=0.14%, 10=1.01%, 20=21.34%, 50=76.73%
  cpu          : usr=0.55%, sys=3.91%, ctx=151723, majf=0, minf=12
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=0.1%, >=64=100.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.1%
     issued rwt: total=0,256000,0, short=0,0,0, dropped=0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=128

Run status group 0 (all jobs):
  WRITE: bw=22.6MiB/s (23.7MB/s), 22.6MiB/s-22.6MiB/s (23.7MB/s-23.7MB/s), io=1000MiB (1049MB), run=44311-44311msec

Disk stats (read/write):
  robusta: ios=0/0, merge=0/0, ticks=0/0, in_queue=0, util=0.00%