bdbm_drv_new_version/run/fio/log/f_iops/1_fio_b512.txt
fio1: (g=0): rw=write, bs=4096B-4096B,4096B-4096B,4096B-4096B, ioengine=libaio, iodepth=128
fio-2.17-37-g855f-dirty
Starting 1 process
fio1: Laying out IO file(s) (1 file(s) / 1000MiB)

fio1: (groupid=0, jobs=1): err= 0: pid=3063: Sun Mar 12 21:15:54 2017
  write: IOPS=10.8k, BW=42.2MiB/s (44.3MB/s)(1000MiB/23712msec)
    slat (usec): min=3, max=37374, avg=91.94, stdev=424.14
    clat (usec): min=0, max=53022, avg=11759.15, stdev=5419.80
     lat (usec): min=5, max=53278, avg=11851.09, stdev=5451.12
    clat percentiles (usec):
     |  1.00th=[  494],  5.00th=[  510], 10.00th=[  700], 20.00th=[ 8768],
     | 30.00th=[11328], 40.00th=[12352], 50.00th=[12992], 60.00th=[14016],
     | 70.00th=[14400], 80.00th=[15296], 90.00th=[15936], 95.00th=[17024],
     | 99.00th=[23680], 99.50th=[30080], 99.90th=[41728], 99.95th=[45824],
     | 99.99th=[50944]
    lat (usec) : 2=0.01%, 10=0.01%, 20=0.01%, 50=0.01%, 100=0.01%
    lat (usec) : 250=0.01%, 500=2.38%, 750=8.87%, 1000=0.87%
    lat (msec) : 2=0.27%, 4=0.88%, 10=10.29%, 20=74.70%, 50=1.69%
    lat (msec) : 100=0.02%
  cpu          : usr=0.84%, sys=6.78%, ctx=123834, majf=0, minf=12
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=0.1%, >=64=100.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.1%
     issued rwt: total=0,256000,0, short=0,0,0, dropped=0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=128

Run status group 0 (all jobs):
  WRITE: bw=42.2MiB/s (44.3MB/s), 42.2MiB/s-42.2MiB/s (44.3MB/s-44.3MB/s), io=1000MiB (1049MB), run=23712-23712msec

Disk stats (read/write):
  robusta: ios=0/0, merge=0/0, ticks=0/0, in_queue=0, util=0.00%