bdbm_drv_new_version/run/fio/log/f_iops/3_fio_b1024-1.txt
fio3: (g=0): rw=write, bs=4096B-4096B,4096B-4096B,4096B-4096B, ioengine=libaio, iodepth=128
fio-2.17-37-g855f-dirty
Starting 1 process
fio3: Laying out IO file(s) (1 file(s) / 1000MiB)

fio3: (groupid=0, jobs=1): err= 0: pid=9270: Sun Mar 12 21:42:04 2017
  write: IOPS=6222, BW=24.4MiB/s (25.5MB/s)(1000MiB/41138msec)
    slat (usec): min=3, max=25826, avg=159.98, stdev=553.62
    clat (usec): min=1, max=49112, avg=20402.50, stdev=5251.25
     lat (usec): min=7, max=49125, avg=20562.48, stdev=5283.26
    clat percentiles (usec):
     |  1.00th=[  498],  5.00th=[ 8096], 10.00th=[15552], 20.00th=[19328],
     | 30.00th=[20608], 40.00th=[21376], 50.00th=[21632], 60.00th=[22144],
     | 70.00th=[23168], 80.00th=[23680], 90.00th=[23936], 95.00th=[24192],
     | 99.00th=[26496], 99.50th=[27008], 99.90th=[32640], 99.95th=[37120],
     | 99.99th=[44288]
    lat (usec) : 2=0.01%, 10=0.01%, 20=0.01%, 50=0.01%, 500=1.09%
    lat (usec) : 750=2.86%, 1000=0.25%
    lat (msec) : 2=0.02%, 4=0.16%, 10=1.12%, 20=21.14%, 50=73.36%
  cpu          : usr=0.52%, sys=4.25%, ctx=131115, majf=0, minf=12
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=0.1%, >=64=100.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.1%
     issued rwt: total=0,256000,0, short=0,0,0, dropped=0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=128

Run status group 0 (all jobs):
  WRITE: bw=24.4MiB/s (25.5MB/s), 24.4MiB/s-24.4MiB/s (25.5MB/s-25.5MB/s), io=1000MiB (1049MB), run=41138-41138msec

Disk stats (read/write):
  robusta: ios=0/0, merge=0/0, ticks=0/0, in_queue=0, util=0.00%