bdbm_drv_new_version/run/fio/log/f_iops/3_fio_b512.txt
fio3: (g=0): rw=write, bs=4096B-4096B,4096B-4096B,4096B-4096B, ioengine=libaio, iodepth=128
fio-2.17-37-g855f-dirty
Starting 1 process
fio3: Laying out IO file(s) (1 file(s) / 1000MiB)

fio3: (groupid=0, jobs=1): err= 0: pid=2976: Sun Mar 12 21:15:33 2017
  write: IOPS=13.4k, BW=50.9MiB/s (53.3MB/s)(1000MiB/19685msec)
    slat (usec): min=2, max=1650.1k, avg=76.19, stdev=3633.15
    clat (usec): min=1, max=1653.6k, avg=9765.42, stdev=41454.36
     lat (usec): min=21, max=1653.7k, avg=9841.62, stdev=41622.97
    clat percentiles (usec):
     |  1.00th=[  490],  5.00th=[  506], 10.00th=[  668], 20.00th=[  988],
     | 30.00th=[ 1672], 40.00th=[ 2800], 50.00th=[ 4320], 60.00th=[ 6880],
     | 70.00th=[14272], 80.00th=[17536], 90.00th=[22656], 95.00th=[25216],
     | 99.00th=[28800], 99.50th=[30080], 99.90th=[40704], 99.95th=[798720],
     | 99.99th=[1646592]
    lat (usec) : 2=0.01%, 50=0.01%, 100=0.01%, 500=3.32%, 750=9.35%
    lat (usec) : 1000=7.40%
    lat (msec) : 2=14.30%, 4=13.49%, 10=17.39%, 20=19.90%, 50=14.75%
    lat (msec) : 1000=0.05%, 2000=0.05%
  cpu          : usr=1.00%, sys=11.42%, ctx=76579, majf=0, minf=13
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=0.1%, >=64=100.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.1%
     issued rwt: total=0,256000,0, short=0,0,0, dropped=0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=128

Run status group 0 (all jobs):
  WRITE: bw=50.9MiB/s (53.3MB/s), 50.9MiB/s-50.9MiB/s (53.3MB/s-53.3MB/s), io=1000MiB (1049MB), run=19685-19685msec

Disk stats (read/write):
  robusta: ios=0/0, merge=0/0, ticks=0/0, in_queue=0, util=0.00%